#### BuiltInFailures.RevisionCloudFailures Members

---

|  |
| --- |
| BuiltInFailures RevisionCloudFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures RevisionCloudFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | ModifyingIssuedRevisionCloudOnUpgrade | During upgrade, an issued revision cloud was moved. Please double check the revision cloud to ensure it is located in the correct place. |
| Public property Static member | ProhibitCreationInIssued | The most current project revision has been issued. No new revision clouds can be created in it. Please add a new revision to the global revision table. |
| Public property Static member | ProhibitModificationOfIssuedRevisionCloud | Issued Revision Clouds can't be modified. |
| Public property Static member | ProhibitSwitchFromIssuedRevision | Can't remove cloud from an Issued Revision. |
| Public property Static member | ProhibitSwitchToIssuedRevision | Can't add cloud to an Issued Revision. |

# See Also

BuiltInFailures RevisionCloudFailures Class

Autodesk.Revit.DB Namespace